---
type: FamilySizeTableColumn
namespace: Autodesk.Revit.DB
version: 2024
members: 5
tags: [revit-api, class]
---

# FamilySizeTableColumn

`Autodesk.Revit.DB.FamilySizeTableColumn` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetSpecTypeId | 2014 | `public ForgeTypeId GetSpecTypeId ()` |
| Method | GetUnitTypeId | 2014 | `public ForgeTypeId GetUnitTypeId ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | Name | 2014 | `public string Name { get ; }` |